//=============================================================================
//
// ライトヘッダー [Light.h]
// Author：HAL東京　ゲーム学科1年生　頼凱興 
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// 初期化処理
HRESULT InitLight(bool FirstInit);
// 更新処理
void UpdateLight(void);
// ライトのビュー行列を取得する
D3DMATRIX GetLightViewMatrix(void);
// ライトの射影変換行列を取得する
D3DMATRIX GetLightProjMatrix(void);
// ライトの座標を取得する
D3DXVECTOR3 GetLightPos(void);

#endif
