//=============================================================================
//
// ポーションモデルヘッダー [Potion.h]
// Author：HAL東京　ゲーム学科1年生　頼凱興 
//
//=============================================================================
#ifndef _POTION_H_
#define _POTION_H_

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3			Pos;				// モデルの位置
	D3DXVECTOR3			Rot;				// モデルの向き(回転)
	D3DXVECTOR3			Scale;				// モデルの大きさ(スケール)
	LPDIRECT3DTEXTURE9	*Texture;			// テクスチャへのポインタ
	LPD3DXMESH			Mesh;				// メッシュ情報へのポインタ
	LPD3DXBUFFER		MaterialBuffer;		// マテリアル情報へのポインタ
	DWORD				MaterialNum;		// マテリアル情報の数
	D3DXMATRIX			WorldMatrix;		// ワールドマトリックス
}POTION;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// 初期化処理
HRESULT InitPotion(bool FirstInit);
// 終了処理
void UninitPotion(void);
// 更新処理
void UpdatePotion(void);
// 描画処理
void DrawPotion(void);

#endif
