//=============================================================================
//
// タイトルヘッダー [Title.h]
// Author：HAL東京　ゲーム学科1年生　頼凱興 
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_


//*****************************************************************************
// マクロ定義
//*****************************************************************************
// タイトルの選択肢状態
enum TitleSelectState
{
	GameStart,				// ゲームスタート
	Difficulty_Easy,		// 難易度Easy
	Difficulty_Normal,		// 難易度Normal
	SkipTutorialCheck,		// チュートリアルスキップ確認
	NoSkip,					// スキップしない
	SkipDetermine,			// スキップする
	AppealMode,				// アピールモード
	ExitGame,				// ゲーム終了
	ExitCheck,				// ゲーム終了確認
	ExitDetermine,			// ゲーム終了する
};

//*****************************************************************************
// 構造体定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// 初期化処理
HRESULT InitTitle(bool FirstInit);
// 終了処理
void UninitTitle(void);
// 更新処理
void UpdateTitle(void);
// 描画処理
void DrawTitle(void);
// 選択肢の状態を取得する
SELECT *GetTitleSelect(void);
// 選択した難易度を取得する
int GetDifficulty(void);

#endif
